{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\nmodelv2.py\u00da\b<lambda>9\u0002\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true, "arguments": {}, "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "dim_ordering": "tf", "bias": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 24, "border_mode": "valid", "nb_col": 5, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "dim_ordering": "tf", "bias": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 36, "border_mode": "valid", "nb_col": 5, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "dim_ordering": "tf", "bias": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 48, "border_mode": "valid", "nb_col": 5, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "dim_ordering": "tf", "bias": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "dim_ordering": "tf", "bias": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "activation": "linear", "b_regularizer": null, "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 256, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_1", "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_2", "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 64, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_3", "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 16, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_4", "b_constraint": null, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "input_dim": null, "W_constraint": null, "activation": "linear", "name": "dense_5", "b_constraint": null, "trainable": true}}]}